import React from "react";
import { Link } from "react-router-dom";
import styles from "./PrivacyPolicy.module.css";
import Container from "../../container/Container";

const PrivacyPolicy = () => {
  return (
    <main>
      <section className={`section`}>
        <Container>
          <div className={styles.content}>
            <h1 className={`title ${styles.title}`}>
              Політика Конфіденційності
            </h1>
            <p className={styles.text}>Дата набуття чинності: 23.10.2023</p>
            <p className={styles.text}>
              Ми на Japfood.cuisine ("ми", "наш" або "нас") цінуємо Вашу
              конфіденційність і зобов'язуємося захищати Вашу особисту
              інформацію. Ця Політика Конфіденційності пояснює, як ми збираємо,
              використовуємо, розкриваємо та захищаємо Ваші персональні дані.
              Користуючись нашим веб-сайтом, Ви погоджуєтеся з практиками,
              описаними в цій політиці.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              1. Умови використання
            </h2>
            <p className={styles.text}>
              <strong>1.1. Загальні положення:</strong> Ваше використання цього
              Веб-сайту підпорядковане нашими{" "}
              <Link to="/terms-and-conditions" className={styles.link}>
                Умовами та Положеннями
              </Link>
              .
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              2. Інформація, яку ми збираємо
            </h2>
            <p className={styles.text}>
              <strong>2.1. Особиста інформація:</strong> Коли Ви зв'язуєтеся з
              нами через сторінку "Допомога", ми можемо збирати наступну
              інформацію:
            </p>
            <ul className={styles.list}>
              <li className={styles.listItem}>Ваше ім'я.</li>
              <li className={styles.listItem}>
                Вашу адресу електронної пошти.
              </li>
            </ul>
            <p className={styles.text}>
              <strong>2.2. Вміст, створений користувачем:</strong> Будь-яка
              додаткова інформація або контент, яку Ви добровільно надаєте, коли
              зв'язуєтеся з нами або взаємодієте з нашим Веб-сайтом.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              3. Використання інформації
            </h2>
            <p className={styles.text}>
              <strong>3.1. Спілкування:</strong> Ми використовуємо Вашу особисту
              інформацію, таку як Ваше ім'я та Вашу адресу електронної пошти,
              щоб відповідати на Ваші запити та надавати підтримку клієнтам.
            </p>
            <p className={styles.text}>
              <strong>3.2. Покращення наших послуг:</strong> Ми можемо
              використовувати Ваші відгуки або іншу надану інформацію для
              покращення нашого Веб-сайту та Послуг.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              4. Обмін інформацією та розкриття інформації
            </h2>
            <p className={styles.text}>
              <strong>4.1. Послуги третіх осіб:</strong> Ми не передаємо Вашу
              особисту інформацію третім особам, за винятком випадків, коли це
              необхідно для надання наших Послуг (наприклад,
              хостинг-провайдерам).
            </p>
            <p className={styles.text}>
              <strong>4.2. Юридичні вимоги:</strong> Ми можемо розкрити Вашу
              інформацію, якщо цього вимагає закон, щоб захистити наші права або
              відповісти на судові процеси.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              5. Захист і безпека даних
            </h2>
            <p className={styles.text}>
              <strong>5.1. Безпека даних:</strong> Ми вживаємо належних заходів
              для захисту Ваших персональних даних від несанкціонованого
              доступу, зміни, розкриття або знищення.
            </p>
            <p className={styles.text}>
              <strong>5.2. Зберігання даних:</strong> Ми зберігаємо Ваші
              персональні дані стільки, скільки необхідно для виконання цілей,
              викладених у цій Політиці Конфіденційності, якщо тільки довший
              термін зберігання не вимагається законом.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              6. Файли cookie та технології відстеження
            </h2>
            <p className={styles.text}>
              <strong>6.1. Файли cookie:</strong> Ми можемо використовувати
              файли cookie та подібні технології відстеження, щоб покращити Ваш
              досвід перегляду веб-сторінок. Ви можете керувати своїми
              налаштуваннями, пов'язаними з файлами cookie.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              7. Сторонні посилання
            </h2>
            <p className={styles.text}>
              <strong>7.1. Зовнішні посилання:</strong> Наш Веб-сайт може
              містити посилання на зовнішні сайти. Ми не несемо відповідальності
              за політику конфіденційності та зміст цих сайтів.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              8. Конфіденційність дітей
            </h2>
            <p className={styles.text}>
              <strong>8.1. Вікові обмеження:</strong> Наші послуги призначені
              для осіб будь-якого віку. Ми свідомо збираємо інформацію від людей
              різного віку. Якщо Ви є батьком або опікуном і вважаєте, що ми
              могли ненавмисно зібрати особисту інформацію від дитини, будь
              ласка, зв'яжіться з нами, щоб видалити її.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>9. Ваші права</h2>
            <p className={styles.text}>
              <strong>9.1. Доступ і виправлення:</strong> Ви маєте право на
              доступ до своєї особистої інформації та її виправлення. Ви можете
              зв'язатися з нами, щоб подати запит на доступ або виправлення.
            </p>
            <p className={styles.text}>
              <strong>9.2. Відмова від отримання:</strong> Ви можете відмовитися
              від отримання маркетингових комунікацій від нас у будь-який час.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              10. Зміни до цієї Політики конфіденційності
            </h2>
            <p className={styles.text}>
              <strong>10.1. Оновлення політики:</strong> Ми можемо час від часу
              оновлювати цю Політику Конфіденційності, щоб відобразити зміни в
              нашій практиці або з інших операційних, юридичних або регуляторних
              причин. Ми повідомимо Вас про будь-які суттєві зміни.
            </p>
            <h2 className={`subtitle ${styles.subtitle}`}>
              11. Зв'язок з нами
            </h2>
            <p className={styles.text}>
              <strong>11.1.</strong> Якщо у Вас виникли будь-які питання,
              занепокоєння або запити щодо Вашої особистої інформації або цієї
              Політики Конфіденційності, будь ласка, зв'яжіться з нами через
              спеціальну форму на сторінці "Допомога".
            </p>
            <p className={styles.text}>
              <strong>
                Ця Політика Конфіденційності востаннє була оновлена 23 жовтня
                2023 року і діє з цієї дати.
                <br />© 2023 Copyright: Japfood.cuisine. Всі права захищені.
              </strong>
            </p>
          </div>
        </Container>
      </section>
    </main>
  );
};

export default PrivacyPolicy;
